import java.util.Scanner;

// BOJ 9095 1, 2, 3 더하기
public class Plus123 {

	public static void main(String[] args) {
		// 테스트 케이스 T
		// 정수 n (n < 11)
		// n 을 1, 2, 3의 합으로 나타내는 방법
		// 0 은 0
		// 1 은 1
		// 1
		
		// 2 는 2
		// 1+1 2
		
		// 3 은 4
		// 1+1+1 1+2 2+1 3
		
		// 4 는 7 => 4 + 2 + 1 = 7
		// 1+1+1+1 1+1+2 1+2+1 2+1+1 1+3 2+2 3+1
		// -정리-
		// 1 + 3 => 1 + 3 = 4
		// 1+1+ 2, 2+ 2 => 2 + 2 = 4
		// 1+1+1+ 1, 1+2 + 1, 2+1 + 1, 3 + 1 => 3 + 1 = 4
		
		// 5 는 13 => 7 + 4 + 2 = 13
		// 1+1+1+1+1 1+1+1+2 1+1+2+1 1+2+1+1 2+1+1+1
		// 1+1+3 1+3+1 3+1+1 2+2+1 2+1+2 1+2+2
		// 2+3 3+2
		// -정리-
		// 1+1 + 3, 2 + 3 => 2 + 3 = 5
		// 1+1+1 + 2,  1+2 + 2, 2+1 + 2, 3 + 2 => 3 + 2 = 5
		// 1+1+1+1 + 1,  1+1+2 + 1, 1+2+1 + 1, 2+1+1 + 1, 1+3 + 1, 2+2 + 1, 3+1 + 1
		// => 4 + 1 = 4
		
		int T;
		int n;
		Scanner sc = new Scanner(System.in);

		T = sc.nextInt();

		int[] arr = new int[11];

		arr[1] = 1;
		arr[2] = 2;
		arr[3] = 4;

		for (int i = 4; i < 11; i++) {
			arr[i] = arr[i - 1] + arr[i - 2] + arr[i - 3];
		}
		
		for(int tc = 0; tc < T; tc++) {
			n = sc.nextInt();
			System.out.println(arr[n]);
		}
	}

}